# BuiltInFailures.RevolutionFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..RevolutionFailures Members
BuiltInFailures..::..RevolutionFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..RevolutionFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CannotDrawRevolution | Can't create surface of revolution. |
| ProfileCrossesRevolutionAxis | The profile must not cross the axis of revolution. |
| ProfileNotPlanar | The Profile must lie in a plane. |

# See Also
BuiltInFailures..::..RevolutionFailures Class
Autodesk.Revit.DB Namespace